AzureActivity 
| where ResourceGroup == "<resource-group-name>"
| where ResourceProviderValue == "Microsoft.Resources"
| where ActivityStatusValue == "Accepted"
| where ActivitySubstatusValue == "Created"
| order by TimeGenerated desc
| project TimeGenerated, CorrelationId, Caller, CallerIpAddress, ResourceGroup, Name=Resource
| join (AzureActivity
| where ActivityStatus == "Started"
| where ResourceProviderValue != "Microsoft.Resources"
| summarize Resources=make_list(ResourceId) by CorrelationId) on CorrelationId
| project TimeGenerated, Caller, CallerIpAddress, ResourceGroup, Name, Resources